package me.edgeconsult.flappybird;

public class PipeSpriteManager {
    // здесь храним все столбики, которые доступны для вывода на экран
    // TODO: завести приватную переменную для хранения столбиков

    // TODO: сделать конструктор класса
    public PipeSpriteManager() {

    }

    // здесь проверяем, какие из уже созданных столбиков вышли из области выдимости
    // и удаляем их из памяти
    // в случае удаления создаем новый столбик с рандомными координантами
    // TODO: сделать метод айпдэйт
    public void update() {

    }

    // прорисовка всех столбов в цикле
    // просто вызываем в теле цикла метод pipeStripe.draw()
    // TODO: сделать метод драу
    public void draw() {

    }
}
